app/Controllers/Auth.php

                    'is_login' => TRUE
                ];
                // Update last login
                $this->db->table('user')->update(['last_login' => date('Y-m-d H:i:s')], ['id' => $data['id']]);
---
UPDATE `user` SET `last_login` = '2023-07-31 20:47:21'
WHERE `id` = '2'