app/Controllers/Dashboard.php

    public function index()
    {
        $startDate = $this->request->getPost('startDate');
        $endDate = $this->request->getPost('endDate');
        $filter = $this->request->getPost('filter');

        helper(['tanggal']);
        $data['title'] = 'Dashboard';

        if (!empty($startDate) && !empty($endDate)) {
            $data['startDate'] = $startDate;
            $data['endDate'] = $endDate;
            $data['penguatan_fungsi'] = $this->db->table('penguatan_fungsi')->getWhere(['tgl_awal >=' => $data['startDate'], 'tgl_awal <=' => $data['endDate']])->getResult();
            $data['pembangunan_strategis'] = $this->db->table('pembangunan_strategis')->getWhere(['tgl_awal >=' => $data['startDate'], 'tgl_awal <=' => $data['endDate']])->getResult();
        } else {
            $data['penguatan_fungsi'] = $this->db->table('penguatan_fungsi')->get()->getResult();
            $data['pembangunan_strategis'] = $this->db->table('pembangunan_strategis')->get()->getResult();
---
SELECT *
FROM `penguatan_fungsi`
SELECT *
FROM `pembangunan_strategis`