app/Controllers/Galeri.php

    public function pembangunan_strategis_info($id)
    {
        helper(['tanggal']);
        $data['pembangunanStrategis'] = $this->db->table('pembangunan_strategis')->getWhere(['id' => $id])->getRow();
        $data['fileRKT'] = $this->db->table('rkt_pembangunan_strategis')->getWhere(['id_pembangunan_strategis' => $id])->getResult();
        $dok_pembangunanStrategisSKW = [];
        if (!empty($data['fileRKT'])) {
            foreach ($data['fileRKT'] as $rkt) {
                $dok_pembangunanStrategisSKW[] = $this->db->table('pembangunan_strategis_skw pss')->join('dokumentasi_pembangunan_strategis_skw dpss', 'dpss.id_pembangunan_strategis_skw=pss.id')->getWhere(['id_rkt' => $rkt->id])->getResult();
---
SELECT *
FROM `rkt_pembangunan_strategis`
WHERE `id_pembangunan_strategis` = '1'
SELECT *
FROM `pembangunan_strategis`
LEFT JOIN `mitra` ON `pembangunan_strategis`.`mitra` = `mitra`.`id_mitra`
WHERE `pembangunan_strategis`.`id` = '1'
SELECT *
FROM `pembangunan_strategis_skw` `pss`
JOIN `dokumentasi_pembangunan_strategis_skw` `dpss` ON `dpss`.`id_pembangunan_strategis_skw`=`pss`.`id`
WHERE `id_rkt` = '1'