app/Controllers/Kerja_sama.php

    public function pembangunan_strategis_add()
    {
        $data['title'] = 'Kerja Sama';
        $data['mitra'] = $this->db->table('mitra')->get()->getResult();
---
SELECT *
FROM `mitra`

    public function getmitra()
    {
        $searchTerm = $this->request->getGet('q');
        if ($searchTerm) {
            $list = $this->db->table('mitra')->like('nama_mitra', $searchTerm)->get()->getResult();
        } else {
            $list = $this->db->table('mitra')->get()->getResult();
---
SELECT *
FROM `mitra`