app/Models/M_kerja_sama.php

    public function penguatan_fungsi()
    {
        $builder = $this->db->table('penguatan_fungsi');
        $builder->select('*');
        // $builder->join('mitra', 'mitra.id_mitra=penguatan_fungsi.mitra', 'left');
        return $builder->get()->getResult();
---
SELECT *
FROM `penguatan_fungsi`

    public function pembangunan_strategis()
    {
        $builder = $this->db->table('pembangunan_strategis');
        $builder->select('pembangunan_strategis.*, mitra.nama_mitra');
        $builder->join('mitra', 'mitra.id_mitra=pembangunan_strategis.mitra', 'left');
        return $builder->get()->getResult();
---
SELECT `pembangunan_strategis`.*, `mitra`.`nama_mitra`
FROM `pembangunan_strategis`
LEFT JOIN `mitra` ON `mitra`.`id_mitra`=`pembangunan_strategis`.`mitra`